:PROPERTIES:
:ID: 66C9469C-9049-4410-89B3-B1D453405E38
:END:
#+title: Add
#+description: Add
#+type: recipe
#+level: cross
#+filetags: :recipe:shell:change_reasons:
#+created: 2026-05-21
#+updated: 2026-05-21

Add a new change reason.

#+name: change-reasons-add
#+begin_src ores-shell :exports none
change-reasons add test_reason "Test reason for recipes" common "New reason for testing."
exit
#+end_src

#+begin_src sh :noweb yes :results output  :wrap example
export ORES_SHELL_LOGIN_PASSWORD
./ores.shell ${log_args} ${connect_args} ${login_args} << 'EOF'
<<change-reasons-add>>
EOF
#+end_src

#+RESULTS:
#+begin_example
✓ Connected to :51004
✓ Logged in as: newuser3
ORE Studio Shell REPL v0.0.8
Type 'help' for available commands, 'exit' to quit.

ores-shell> ✓ Change reason added successfully!
ores-shell> Bye!
#+end_example
